<a href="https://colab.research.google.com/github/Charee-Villapong/charee-villapong/blob/master/pdf_excel_converter.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [70]:
!pip install -q tabula-py

In [71]:
!pip install openpyxl

Requirement already satisfied: openpyxl in /usr/local/lib/python3.7/dist-packages (2.5.9)
Requirement already satisfied: jdcal in /usr/local/lib/python3.7/dist-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et-xmlfile in /usr/local/lib/python3.7/dist-packages (from openpyxl) (1.1.0)

In [72]:
!java -version

openjdk version "11.0.11" 2021-04-20
OpenJDK Runtime Environment (build 11.0.11+9-Ubuntu-0ubuntu2.18.04)
OpenJDK 64-Bit Server VM (build 11.0.11+9-Ubuntu-0ubuntu2.18.04, mixed mode, sharing)

In [73]:
import tabula

tabula.environment_info()

Python version:
    3.7.12 (default, Sep 10 2021, 00:21:48)
[GCC 7.5.0]
Java version:
    openjdk version "11.0.11" 2021-04-20
OpenJDK Runtime Environment (build 11.0.11+9-Ubuntu-0ubuntu2.18.04)
OpenJDK 64-Bit Server VM (build 11.0.11+9-Ubuntu-0ubuntu2.18.04, mixed mode, sharing)
tabula-py version: 2.3.0
platform: Linux-5.4.104+-x86_64-with-Ubuntu-18.04-bionic
uname:
    uname_result(system='Linux', node='090cc395ec77', release='5.4.104+', version='#1 SMP Sat Jun 5 09:50:34 PDT 2021', machine='x86_64', processor='x86_64')
linux_distribution: ('Ubuntu', '18.04', 'bionic')
mac_ver: ('', ('', '', ''), '')

In [74]:
import tabula
pdf_path = "/content/drive/MyDrive/04_h2-1.pdf"

In [75]:
dfs = tabula.read_pdf(pdf_path, stream=True,pages="1")

Got stderr: Nov 27, 2021 1:13:20 AM org.apache.pdfbox.pdmodel.font.PDCIDFontType2 findFontOrSubstitute
WARNING: Using fallback font LiberationSans for CID-keyed TrueType font ‚l‚r–¾’©
Nov 27, 2021 1:13:20 AM org.apache.pdfbox.pdmodel.font.PDCIDFontType2 findFontOrSubstitute
WARNING: Using fallback font LiberationSans for CID-keyed TrueType font ‚l‚rƒSƒVƒbƒN
Nov 27, 2021 1:13:21 AM org.apache.pdfbox.rendering.TTFGlyph2D getPathForGID
WARNING: No glyph for code 37350 (CID 0b48) in font ‚l‚r–¾’©
Nov 27, 2021 1:13:21 AM org.apache.pdfbox.rendering.TTFGlyph2D getPathForGID
WARNING: No glyph for code 33186 (CID 02da) in font ‚l‚rƒSƒVƒbƒN
Nov 27, 2021 1:13:21 AM org.apache.pdfbox.pdmodel.font.PDCIDFontType2 findFontOrSubstitute
WARNING: Using fallback font LiberationSans for CID-keyed TrueType font ‚l‚r–¾’©
Nov 27, 2021 1:13:21 AM org.apache.pdfbox.pdmodel.font.PDCIDFontType2 findFontOrSubstitute
WARNING: Using fallback font LiberationSans for CID-keyed TrueType font ‚l‚rƒSƒVƒbƒN

In [76]:
print(len(dfs))
dfs[0]

1

     Unnamed: 0 Unnamed: 1 Unnamed: 2         (再    掲) Unnamed: 3 Unnamed: 4
0            1)        NaN        NaN              NaN        NaN        NaN
1          年  次      出 生 数      死 亡 数              NaN        NaN      自然増減数
2           NaN        NaN        NaN     乳児死亡数 新生児死亡数        NaN        NaN
3   1947  昭和22年  2 678 792  1 138 238  205 360  84 204        NaN  1 540 554
4         48 23  2 681 624    950 610  165 406  73 855        NaN  1 731 014
..          ...        ...        ...              ...        ...        ...
72       16  28    977 242  1 308 158      1 929   875          △    330 916
73       17  29    946 146  1 340 567      1 762   833          △    394 421
74       18  30    918 400  1 362 470      1 748   801          △    444 070
75     19  令和元年    865 239  1 381 093      1 654   755          △    515 854
76     2020   2    840 835  1 372 755      1 512   704          △   5 31 920

[77 rows x 6 columns]

In [77]:
#dfs[0].drop(range(0,1),axis=0,inplace=True)

In [78]:
columns=["年 次","出 生 数","死 亡 数","乳児死亡数","新生児死亡数","自然増減数"]
#dfs[0].drop(range(1,3),axis=0,inplace=True)
dfs[0].set_axis(columns,axis="columns",inplace=True)
dfs[0]

            年 次      出 生 数      死 亡 数            乳児死亡数 新生児死亡数      自然増減数
0            1)        NaN        NaN              NaN    NaN        NaN
1          年  次      出 生 数      死 亡 数              NaN    NaN      自然増減数
2           NaN        NaN        NaN     乳児死亡数 新生児死亡数    NaN        NaN
3   1947  昭和22年  2 678 792  1 138 238  205 360  84 204    NaN  1 540 554
4         48 23  2 681 624    950 610  165 406  73 855    NaN  1 731 014
..          ...        ...        ...              ...    ...        ...
72       16  28    977 242  1 308 158      1 929   875      △    330 916
73       17  29    946 146  1 340 567      1 762   833      △    394 421
74       18  30    918 400  1 362 470      1 748   801      △    444 070
75     19  令和元年    865 239  1 381 093      1 654   755      △    515 854
76     2020   2    840 835  1 372 755      1 512   704      △   5 31 920

[77 rows x 6 columns]

In [79]:
dfs[0]
#dfs[0].set_index("年 次")

            年 次      出 生 数      死 亡 数            乳児死亡数 新生児死亡数      自然増減数
0            1)        NaN        NaN              NaN    NaN        NaN
1          年  次      出 生 数      死 亡 数              NaN    NaN      自然増減数
2           NaN        NaN        NaN     乳児死亡数 新生児死亡数    NaN        NaN
3   1947  昭和22年  2 678 792  1 138 238  205 360  84 204    NaN  1 540 554
4         48 23  2 681 624    950 610  165 406  73 855    NaN  1 731 014
..          ...        ...        ...              ...    ...        ...
72       16  28    977 242  1 308 158      1 929   875      △    330 916
73       17  29    946 146  1 340 567      1 762   833      △    394 421
74       18  30    918 400  1 362 470      1 748   801      △    444 070
75     19  令和元年    865 239  1 381 093      1 654   755      △    515 854
76     2020   2    840 835  1 372 755      1 512   704      △   5 31 920

[77 rows x 6 columns]

In [80]:
dfs[0].to_excel("04_h2-1.xlsx",sheet_name='new_sheet')